### Terraform `plan` Succeeded for Workspace: `default`
  
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_storage_blob.training_content_blobs["../web_content/404.html"] must be replaced
-/+ resource "azurerm_storage_blob" "training_content_blobs" {
!       access_tier            = "Hot" -> (known after apply)
!       content_md5            = "c07390ca37a0e514aa1b52c8b80cf7b1" -> "dc9978c08f51213f078cc5881030ff50" # forces replacement
!       id                     = "https://tamughtrnjsheehy.blob.core.windows.net/$web/404.html" -> (known after apply)
!       metadata               = {} -> (known after apply)
        name                   = "404.html"
!       url                    = "https://tamughtrnjsheehy.blob.core.windows.net/$web/404.html" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.training_content_blobs["../web_content/index.html"] must be replaced
-/+ resource "azurerm_storage_blob" "training_content_blobs" {
!       access_tier            = "Hot" -> (known after apply)
!       content_md5            = "b06f51288ee68871971902abb3d64708" -> "fb7ffa9f3c63f1bd292ab72bd7ee03fb" # forces replacement
!       id                     = "https://tamughtrnjsheehy.blob.core.windows.net/$web/index.html" -> (known after apply)
!       metadata               = {} -> (known after apply)
        name                   = "index.html"
!       url                    = "https://tamughtrnjsheehy.blob.core.windows.net/$web/index.html" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```
</details>
  